{"basics":{"name":"Sam Voisin","label":"Data Scientist","image":"","email":"samvoisin@protonmail.com","url":"https://samvoisin.github.io/","summary":"I am a driven and results-oriented data scientist with extensive experience in designing and implementing innovative data pipelines, models, and algorithms.","skills":"Predictive modeling - Bayesian and classical statistics - Deep learning - Natural language processing - Advanced Python skill - Pytorch, huggingface, spacy - Linux/Unix & Docker","profiles":[{"network":"Twitter","username":"AlbertEinstein","url":"https://twitter.com/AlbertEinstein"}]},"work":[{"name":"Infinia ML, Durham, NC","position":"Data Scientist","startDate":"2022-03-01","endDate":"PRESENT","summary":"In my current role, I develop flexible document processing pipelines for information extraction and classification. My current interest is integrating SOTA large language models to perform advanced document analysis tasks."},{"name":"Geometric Data Analytics, Inc, Durham, NC","position":"Data Scientist","startDate":"2020-06-01","endDate":"2022-03-01","summary":"Research and development for clients including DARPA, NRL, and AFRL. Developed novel algorithms for oceanographic research, remote sensing, and pattern-of-life modeling. See publications."},{"name":"Duke University, Durham, NC","position":"Research Assistant","startDate":"2019-04-01","endDate":"2019-09-01","summary":"Crafted research goals, planned and executed experiments, designed data pipelines, and optimized MCMC samplers for Bayesian hierarchical regression models."},{"name":"Ally Financial Services, Charlotte, NC","position":"Analyst","startDate":"2015-01-01","endDate":"2018-06-01","summary":"Analyzed financial market data and business metrics to mitigate business risk risk. Automated data gathering and processing. Acted as program lead and mentor for department internship program."}],"volunteer":[],"education":[{"institution":"Duke University, Trinity College of Arts and Sciences","area":"Statistical Science","studyType":"M.S.","startDate":"2018-08-01","endDate":"2020-05-01","thesis":"Graph Diffusion Methods for Gesture Classification"},{"institution":"Clemson University, College of Business and Behavioral Science","area":"Financial Management","studyType":"B.S.","startDate":"2010-08-01","endDate":"2014-12-01"}],"awards":[{"title":"University of South Carolina Big Data Health Science Conference 2020","date":"2020-02-11","awarder":"UofSC Big Data Health Science Center","summary":"First place at UofSC Big Data Health Science Conference 2020 case study competition. The objective of the case study was to develop a platform to aid first responders in diagnosing chemical exposure. We developed an interpretable nearest-neighbors model to transparently diagnose exposure to a wide variety of chemical agents."}],"certificates":[],"publications":[],"skills":[],"interests":[],"references":[],"projects":[]}