{
  "basics": {
    "name": "Sam Voisin",
    "label": "Data Scientist and Software Engineer",
    "image": "",
    "email": "samvoisin@protonmail.com",
    //"phone": "(912) 123-4567",
    "url": "https://www.samvoisin.com/",
    "summary": "Skilled data scientist and software engineer with extensive experience in developing robust data pipelines, scalable architectures, and efficient algorithms. Proficient in integrating data science techniques into software solutions, with a strong foundation in statistical modeling, machine learning, and software design. Seeking a position to contribute to innovative data-driven projects.",
    // "skills": "I possess expertise in predictive modeling, Python, and R, with proficiency in deep learning and NLP techniques. My skills include RESTful API development, database management, and ML Ops. I am also experienced in Agile methodology and excel in communicating complex concepts to diverse audiences.",
    // "location": {
    //   "address": "2712 Broadway St",
    //   "postalCode": "CA 94115",
    //   "city": "San Francisco",
    //   "countryCode": "US",
    //   "region": "California"
    // },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "samvoisin",
        "url": "www.linkedin.com/in/samvoisin"
      }
    ]
  },
  "work": [
    {
      "name": "Tradewind Data Science, Durham, NC",
      "position": "Data Scientist",
      "startDate": "2023-10-01",
      "endDate": "",
      "summary": "Analyzed consumer trends and provided actionable insights for data-driven decision-making. Improved client revenue through advanced econometric modeling, optimizing pricing strategies."
    },
    {
      "name": "Infinia ML, Durham, NC",
      "position": "Data Scientist",
      "startDate": "2022-03-01",
      "endDate": "2023-10-01",
      "summary": "Developed flexible document processing pipelines for information extraction and classification. Designed and implemented large language model (LLM) infrastructure."
    },
    {
      "name": "Geometric Data Analytics, Inc, Durham, NC",
      "position": "Data Scientist",
      "startDate": "2020-06-01",
      "endDate": "2022-03-01",
      "summary": "Research and development for clients including DARPA, NRL, and AFRL. Developed novel algorithms for oceanographic research, remote sensing, and pattern-of-life modeling. See publications."
    },
    {
      "name": "Duke University, Durham, NC",
      "position": "Research Assistant",
      "startDate": "2019-04-01",
      "endDate": "2019-09-01",
      "summary": "Crafted research goals, planned and executed experiments, designed data pipelines, and optimized MCMC samplers for Bayesian hierarchical regression models."
    },
    {
      "name": "Ally Financial Services, Charlotte, NC",
      "position": "Analyst",
      "startDate": "2015-01-01",
      "endDate": "2018-06-01",
      "summary": "Analyzed financial market data and business metrics to mitigate business risk. Automated data gathering and processing. Acted as program lead and mentor for department internship program."
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "Duke University, Trinity College of Arts and Sciences",
      "area": "Statistical Science",
      "studyType": "M.S.",
      "startDate": "2018-08-01",
      "endDate": "2020-05-01",
      "thesis": "Graph Diffusion Methods for Gesture Classification"
    },
    {
      "institution": "Clemson University, College of Business and Behavioral Science",
      "area": "Financial Management",
      "studyType": "B.S.",
      "startDate": "2010-08-01",
      "endDate": "2014-12-01"
    }
  ],
  "awards": [
    {
      "title": "University of South Carolina Big Data Health Science Conference 2020",
      "date": "2020-02-11",
      "awarder": "UofSC Big Data Health Science Center",
      "summary": "First place at UofSC Big Data Health Science Conference 2020 case study competition. The objective of the case study was to develop a platform to aid first responders in diagnosing chemical exposure. We developed an interpretable nearest-neighbors model to transparently diagnose exposure to a wide variety of chemical agents."
    }
  ],
  "certificates": [],
  "publications": [
    {
    "name": "Topological Simplification of Signals for Inference and Approximate Reconstruction",
    "publisher": "2023 IEEE Aerospace Conference",
    "releaseDate": "2023-03-01",
    "url": "https://en.wikisource.org/wiki/Translation:On_the_Electrodynamics_of_Moving_Bodies",
    "summary": "As Internet of Things (loT) devices become both cheaper and more powerful, researchers are increasingly finding solutions to their scientific curiosities both financially and com- putationally feasible. When operating with restricted power or communications budgets, however, devices can only send highly- compressed data. Such circumstances are common for devices placed away from electric grids that can only communicate via satellite, a situation particularly plausible for environmental sensor networks. These restrictions can be further complicated by potential variability in the communications budget, for ex-ample a solar-powered device needing to expend less energy when transmitting data on a cloudy day. We propose a novel, topology-based, lossy compression method well-equipped for these restrictive yet variable circumstances. This technique, Topological Signal Compression, allows sending compressed sig-nals that utilize the entirety of a variable communications budget. To demonstrate our algorithm's capabilities, we per-form entropy calculations as well as a classification exercise on increasingly topologically simplified signals from the Free- Spoken Digit Dataset and explore the stability of the resulting performance against common baselines."
  },
  {
    "name": "Topological Feature Tracking for Submesoscale Eddies",
    "publisher": "Geophysical Research Letters",
    "releaseDate": "2022-09-27",
    "url": "https://agupubs.onlinelibrary.wiley.com/doi/abs/10.1029/2022GL099416",
    "summary": "Abstract Current state-of-the art procedures for studying modeled submesoscale oceanographic features have made a strong assumption of independence between features identified at different times. Therefore, all submesoscale eddies identified in a time series were studied in aggregate. Statistics from these methods are illuminating but oversample identified features and cannot determine the lifetime evolution of the transient submesoscale processes. To this end, the authors apply the Topological Feature Tracking (TFT) algorithm to the problem of identifying and tracking submesoscale eddies over time. TFT identifies critical points on a set of time-ordered scalar fields and associates those points between consecutive timesteps. The procedure yields tracklets which represent spatio-temporal displacement of eddies. In this way we study the time-dependent behavior of submesoscale eddies, which are generated by a 1-km resolution submesoscale-permitting model. We summarize the submesoscale eddy data set produced by TFT, which yields unique, time-varying statistics."
  },
  {
    "name": "[Whitepaper] Automation is All You Need: Faster Earth Systems Models with AI/ML",
    "publisher": "US Department of Energy",
    "releaseDate": "2021-12-01",
    "url": "https://www.ai4esp.org/files/AI4ESP1009_Ball_Kenneth.pdf",
    "summary": "Tropical cyclones can induce extreme water cycle events through dramatic precipitation and storm surge. More reliable models of intensity will translate into better prediction of the impact of extreme events in large scale Earth systems simulations. We demonstrate and describe AI/ML methodologies for rapid assimilation of new, in situ data products."
  }
],
  "skills": [
    {
      "name": "Probability and Statistics",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Bayesian inference",
        "Statistical modeling",
        "Predictive modeling"
      ]
    },
    {
      "name": "Programming",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Python",
        "SQL",
        "R"
      ]
    },
    {
      "name": "Machine Learning",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Deep learning",
        "Natural Language Processing",
        "Computer Vision",
        "Pytorch"
      ]
    },
    {
      "name": "Software Development",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Object-oriented programming",
        "Docker",
        "Kubernetes",
        "RESTful APIs",
        "Agile methodology"
      ]
    },
    {
      "name": "Data Management",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "PostgreSQL",
        "Neo4j",
        "PySpark"
      ]
    }
  ],
  // "languages": [
  //   {
  //     "language": "German",
  //     "fluency": "Native speaker"
  //   },
  //   {
  //     "language": "English",
  //     "fluency": "Fluent"
  //   }
  // ],
  "interests": [],
  "references": [],
  "projects": []
}
